In [3]:
import pandas as pd
dataset = pd.read_csv("Placement.csv")
dataset

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
210,211,M,80.60,Others,82.00,Others,Commerce,77.60,Comm&Mgmt,No,91.0,Mkt&Fin,74.49,Placed,400000.0
211,212,M,58.00,Others,60.00,Others,Science,72.00,Sci&Tech,No,74.0,Mkt&Fin,53.62,Placed,275000.0
212,213,M,67.00,Others,67.00,Others,Commerce,73.00,Comm&Mgmt,Yes,59.0,Mkt&Fin,69.72,Placed,295000.0
213,214,F,74.00,Others,66.00,Others,Commerce,58.00,Comm&Mgmt,No,70.0,Mkt&HR,60.23,Placed,204000.0
214,215,M,62.00,Central,58.00,Others,Science,53.00,Comm&Mgmt,No,89.0,Mkt&HR,60.22,Not Placed,NaN

In [4]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sl_no           215 non-null    int64
 1   gender          215 non-null    object
 2   ssc_p           215 non-null    float64
 3   ssc_b           215 non-null    object
 4   hsc_p           215 non-null    float64
 5   hsc_b           215 non-null    object
 6   hsc_s           215 non-null    object
 7   degree_p        215 non-null    float64
 8   degree_t        215 non-null    object
 9   workex          215 non-null    object
 10  etest_p         215 non-null    float64
 11  specialisation  215 non-null    object
 12  mba_p           215 non-null    float64
 13  status          215 non-null    object
 14  salary          148 non-null    float64
dtypes: float64(6), int64(1), object(8)
memory usage: 25.3+ KB

In [14]:
dataset.describe()

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
count,215.000000,215.000000,215.000000,215.000000,215.000000,215.000000,148.000000
mean,108.000000,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
std,62.209324,10.827205,10.897509,7.358743,13.275956,5.833385,93457.452420
min,1.000000,40.890000,37.000000,50.000000,50.000000,51.210000,200000.000000
25%,54.500000,60.600000,60.900000,61.000000,60.000000,57.945000,240000.000000
50%,108.000000,67.000000,65.000000,66.000000,71.000000,62.000000,265000.000000
75%,161.500000,75.700000,73.000000,72.000000,83.500000,66.255000,300000.000000
max,215.000000,89.400000,97.700000,91.000000,98.000000,77.890000,940000.000000

1) Replace the NaN values with correct value. And justify why you have
chosen the same.

In [15]:
dataset.isnull().sum()

sl_no              0
gender             0
ssc_p              0
ssc_b              0
hsc_p              0
hsc_b              0
hsc_s              0
degree_p           0
degree_t           0
workex             0
etest_p            0
specialisation     0
mba_p              0
status             0
salary            67
dtype: int64

In [16]:
dataset["salary"].fillna(0,inplace=True)

In [17]:
dataset.isnull().sum()

sl_no             0
gender            0
ssc_p             0
ssc_b             0
hsc_p             0
hsc_b             0
hsc_s             0
degree_p          0
degree_t          0
workex            0
etest_p           0
specialisation    0
mba_p             0
status            0
salary            0
dtype: int64

Answer:
He i have replaced the salary column with 0 because it won't be good to go with mean, median, mode values for a candidate who is not placed

2) How many of them are not placed?

In [26]:
dataset[dataset["status"]=="Not Placed"]["status"].count()

67

3) Find the reason for non placement from the dataset?

In [28]:
dataset["status"].value_counts()

status
Placed        148
Not Placed     67
Name: count, dtype: int64

Anova Test:

In [73]:
from scipy import stats

ssc_p_placed = dataset[dataset["status"]=="Not Placed"]["ssc_p"]
ssc_p_notplaced = dataset[dataset["status"]=="Placed"]["ssc_p"]

print(stats.f_oneway(ssc_p_placed,ssc_p_notplaced))


hsc_p_placed = dataset[dataset["status"]=="Not Placed"]["hsc_p"]
hsc_p_notplaced = dataset[dataset["status"]=="Placed"]["hsc_p"]

print(stats.f_oneway(hsc_p_placed,hsc_p_notplaced))

degree_p_placed = dataset[dataset["status"]=="Not Placed"]["degree_p"]
degree_p_notplaced = dataset[dataset["status"]=="Placed"]["degree_p"]

print(stats.f_oneway(degree_p_placed,degree_p_notplaced))

etest_p_placed = dataset[dataset["status"]=="Not Placed"]["etest_p"]
etest_p_notplaced = dataset[dataset["status"]=="Placed"]["etest_p"]

print(stats.f_oneway(etest_p_placed,etest_p_notplaced))

mba_p_placed = dataset[dataset["status"]=="Not Placed"]["mba_p"]
mba_p_notplaced = dataset[dataset["status"]=="Placed"]["mba_p"]

F_onewayResult(statistic=124.84250634372715, pvalue=4.115201043884882e-23)
F_onewayResult(statistic=67.74518757489524, pvalue=1.8492127569315302e-14)
F_onewayResult(statistic=63.71917613798709, pvalue=8.807682138862259e-14)
F_onewayResult(statistic=3.5276269558503235, pvalue=0.061720381110172244)

From one way anova i could see the ssc_p feature is more significant and has high impact on Placed and Not Placed Students